{"id":"44878097","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Senior Python Developer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":"Москва","street":"Рублёвское шоссе","building":"28","description":null,"lat":55.747834,"lng":37.42562,"raw":"Москва, Рублёвское шоссе, 28","metro":null,"metro_stations":[]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"noExperience","name":"Нет опыта"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Привет!</p> <p><strong>Мы VK Pay – умное приложение ваших денег.</strong></p> <p>Наша команда строит финтех-платформу, которая соединяет многомиллионную онлайн-аудиторию покупателей, что ищет выгоду от покупок - с тысячами продавцов, кто ищут современные способы привлекать и удерживать потребителя</p> <p><strong>О компании:</strong></p> <p>1. Мы строим и развиваем механизмы бесшовной интеграции платежных методов (таких как карта, бонусная программа, рассрочка) покупателя в сайт продавца - чтобы покупки всегда были удобными. Наш чекаут значительно повышает конверсии в покупку по сравнению с традиционными способами сбора платежей.</p> <p>2. Мы развиваем партнерские отношения с финансовыми организациями, чтобы процесс покупки был выгодным при оплате как своими, так и кредитными средствами. Мы эффективны в своих процессах, а значит можем переложить эту эффективность в лучшую цену, так как выигрываем на частоте совершаемых покупок.</p> <p>3. Мы строим умные механизмы таргетирования, чтобы потребитель всегда мог найти выгодное предложение продавца. Мы круглосуточно ищем для клиентов наиболее выгодные предложения от разных продавцов и наших банков-партнеров.</p> <p>Каждый месяц мы обслуживаем 35 млн операций более 18 млн своих клиентов и хотим стать самым удобным и безопасным механизмом выгодных расчетов.</p> <p> </p> <p>Нас порядка 450 сотрудников и мы ищем крутых коллег, которые подойдут нам как по скиллам, так и по личностным качествам. В нашей компании работают выходцы из ВКонтакте, Мэйл.ру, Яндекса, Алиэкспресс и других классных компаний. Наша команда, действительно, одна из самых крутых и амбициозных на рынке.</p> <p>Мы пользуемся возможностями больших компаний, которые являются нашими акционерами, но в нас силён дух стартапа, поэтому, никаких излишних бюрократических моментов, полное доверие и поддержка друг друга. Нам важна простота в коммуникациях, отсутствие подковёрных игр и чинопочитания. Часто нам приходит в голову идея и мы пилим её сразу же, понимая, что она супер крутая.</p> <p>У нас много партнеров: Aliexpress, Mail.Ru, МегаФон, Yota, фасилитаторы/агрегаторы типа PayOnline, Qiwi, Робокасса, Ecommpay, ArsenalPay и другие.</p> <p>Мы не боимся использовать Python в суровом production: для распределенных вычислений, нагруженных систем и ответственных задач. Мы УЖЕ написали карточный процессинг на асинхронном Python (Python 3.8+, tornadoweb, aiohttp, fastapi), который успешно работает под нагрузками более 5 лет. У нас есть свой антифрод, системы принятия решений и другие realtime сервисы. Мы выпустили более 3 миллионов банковских карт и разработали развитой интернет эквайринг. Наши задачи будут в первую очередь интересны тем разработчикам, кто уже перерос начальный уровень, и готовы к новым вызовам. Часто, у нас очень сложно, но интересно.</p> <p> </p> <p><strong>О вакансии:</strong></p> <p>Мы ищем в команду Python разработчика, которому предстоит пилить кредитные системы для действующих и будущих партнёров:</p> <p><strong>Стек:</strong></p> <p>Наш стек-технологий: Python (стремимся поддерживать самые новые версии), Postgres, асинхронные фреймворки FastAPI, AioHttp, Redis, Kafka, Linux, Atlassian (Jira, Confluence), Gitlab.</p> <p><strong>Задачи:</strong></p> <ul> <li> <p>Разработка новых сервисов для интеграции готовых систем кредитования партнеров в уже существующие системы, сложные с точки зрения логики системы;</p> </li> <li> <p>Оптимизация готовых систем для повышения их нагрузочной способности;</p> </li> <li> <p>Разработка новых сервисов под новые направления развития Компании;</p> </li> <li> <p>Участие в построении архитектуры сервисов;</p> </li> <li> <p>Проведение Code Review.</p> </li> </ul> <p> </p> <p><strong>Требования:</strong></p> <ul> <li> <p>Опыт коммерческой разработки на Python 3 от 2х лет;</p> </li> <li> <p>Понимание работы и принципов проектирования высоконагруженных систем;</p> </li> <li> <p>Опыт многопоточного и асинхронного программирования;</p> </li> </ul> <ul> <li> <p>Опыт работы с реляционными СУБД;</p> </li> <li> <p>Знание Linux на уровне продвинутого пользователя;</p> </li> <li> <p>Умение работать с git;</p> </li> <li> <p>Понимание Docker.</p> </li> </ul> <p><strong>Что мы предлагаем:</strong></p> <ul> <li> <p>Заработная плата выше рынка – готовы выслушать твои ожидания;</p> </li> <li> <p>Свободное время начала рабочего дня (в среднем, народ собирается с 10-12, но это не жёстко);</p> </li> <li> <p>Можно работать удалённо и посещать офис только в случае крайней необходимости или, по желанию, из офиса;</p> </li> <li> <p>Крутой офис класса «А» в 12 минутах ходьбы от метро Молодёжная с корпоративным трансфером каждые 15 минут;</p> </li> <li> <p>Фрукты, печеньки, кола, готовые завтраки, дошираки, крутая кофемашина с отличным кофе и куча других &quot;плюшек&quot;;</p> </li> <li> <p>Настольный теннис и футбол, шкаф с литературой, велопарковка и душ;</p> </li> <li> <p>Новые мощные MacBook Pro для комфортной работы;</p> </li> <li> <p>Медицинское страхование от Best Doctor;</p> </li> <li> <p>Мы любим, когда люди растут. Поэтому, мы компенсируем затраты на профильную литературу, отправляем наших ребят на онлайн и оффлайн конференции;</p> </li> <li> <p>Конечно же, полностью белое оформление согласно ТК РФ.</p> </li> </ul> <p> </p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"Git"},{"name":"Atlassian Jira"},{"name":"Redis"},{"name":"Linux"},{"name":"Kafka"},{"name":"FastApi"},{"name":"AioHttp"},{"name":"Atlassian Confluence"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.9","name":"Web инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"5313148","name":"VK Pay","url":"https://api.hh.ru/employers/5313148?host=hh.ru","alternate_url":"https://hh.ru/employer/5313148","logo_urls":{"90":"https://hhcdn.ru/employer-logo/3771883.png","240":"https://hhcdn.ru/employer-logo/3771884.png","original":"https://hhcdn.ru/employer-logo-original/832750.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=5313148&host=hh.ru","trusted":true},"published_at":"2021-12-09T17:35:43+0300","created_at":"2021-12-09T17:35:43+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=44878097","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/44878097","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}