{"id":"50080161","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Senior Python Developer (DS)","insider_interview":null,"response_letter_required":true,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Welltory</strong> — приложение №1 в России про здоровье. 3M+ юзеров, 40k ☆☆☆☆☆ оценок, core audience - США. У нас есть огромный раздел My data, в котором пользователь может увидеть сотни графиков с его данными, подключать разные сервисы, чтобы трекать еще больше данных, искать на этих графиках зависимости между разными аспектами образа жизни. Над этим разделом работает команда из 3 разработчиков, 2 тестировщиков и продакт-менеджера. Сейчас у нас около 10 сервисов, с которыми уже настроена интеграция, среди них Apple Health, Google Fit, Samsung Health, Garmin, Fitbit и тд. У нас есть желание интегрироваться с еще большим количеством, для этого мы планируем усилить команду еще одним разработчиком.</p> <p><strong>Что нам важно в вашем опыте:</strong></p> <ul> <li>У вас есть не меньше 3 лет в продуктовой разработке.</li> <li>Умеете делать сбор и обработку данных на Python/Fast API/Django/Celery.</li> <li>Понимаете, что пока функциональность не на production - значит работа не окончена.</li> <li>Практикуете применение линтеров, форматеров кода и знаете о performance monitoring (Sentry APM).</li> <li>Считаете, что без тестов, мониторинга, сбора ошибок в Sentry и документации не стоит выпускать продукт в production.</li> <li>Если знаете что такое Cassandra/AWS SQS, Lambda/C4 model - будет еще интереснее работать.</li> <li>Умеете аргументированно стоять на предложенных технических решениях, не давая снижать качество продукта.</li> </ul> <p><strong>Какие задачи предстоит решать:</strong></p> <ul> <li>Мы занимаемся анализом здоровья и личной продуктивности на основе множества данных из различных источников (Apple health, GoogeFit, Garmin, RescueTime и т.п.).</li> <li>Получаем данные (пульс, шаги, тренировки, погода и т.п.), строим по ним и нашим ML-моделям аналитику, и даем рекомендации для наших пользователей, как им легко улучшить свой образ жизни.</li> <li>Вашей задачей будет развитие и поддержка системы, которая работает с входными данными: (сбор, сохранение и подготовка данных из различных источников, извлечение из данных смысла с помощью ML-моделей).</li> <li>Разработка инструментария который проверяет и отслеживает консистентность, полноту данных.</li> <li>Повышение производительности системы за счет оптимизации кода, переработки компонентов архитектуры.</li> </ul> <p><strong>Что мы предлагаем:</strong></p> <ul> <li>Интересный продукт, о котором приятно рассказать в баре друзьям или на конференции. Welltory пользуются больше миллиона человек по всему миру, чтобы вести здоровый образ жизни и следить за самочувствием с помощью данных. Можно каждый день читать отзывы и чувствовать, как растет ваша карма.</li> <li>Максимально отлаженные и автоматизированные процессы, высокое качество постановки задач, хорошее покрытие тестами и полное покрытие качественной документацией.</li> <li>Мало старого или плохого legacy-кода, компания в стадии активной разработки.</li> <li>Мы американская компания, платим net, работаем с ИП. Отпуска и отгулы не ограничены и не контролируются. У тебя будет гибкий график и свобода физического местонахождения.</li> <li>Свобода графика, физического местонахождения. Свобода в выборе дней для «перезагрузки» и перелетов. Безлимитные дей-оффы и отпуска за счет компании.</li> <li>Политика прозрачности со стороны фаундеров. Ежеквартальные отчеты для всей команды о том, что происходит с компанией, тактикой, стратегией, метриками. Открытость и возможность обсудить любые вопросы напрямую.</li> <li>Мы гарантируем отсутствие бюрократии, «больших начальников», идиотских решений, политики и невозможности что-то изменить. В компании нет «менеджеров», которые при этом не создают ценность своими руками, нет длинных цепочек согласований и так далее.</li> <li>Компания не торгует данными пользователей, не зарабатывает ни на каких «партнерствах», не занимается скрытой рекламой и прочим беспощадным ecommerce. Мы работаем для наших пользователей, они платят нам деньги, точка.</li> <li>Есть офис в Петербурге, ходить туда не обязательно, хоть у нас и очень уютно (Петроградка, выход на крышу, лампово и прикольно). В офисе есть гостевая зона для сотрудников, которые приезжают к нам потусоваться из других городов, можно не снимать гостиницу и жить в офисе.</li> <li>Вы окажетесь в команде заряженных и очень профессиональных людей, все приятные бонусы атмосферы стартапа без минусов в виде бардака и недофинансирования. У вас будут все возможности для роста.</li> </ul> <p><strong>Дополнительно</strong></p> <p>При отклике предстоит сделать тестовое задание. Мы не затягиваем с фидбеком и даем его на следующий день, как получим готовое тестовое. После у нас будет не больше 2 интервью - с лидом и командой.</p> <p>Тестовое задание на том или ином этапе делать все равно придется, потому что мы не верим в резюме, а работа в крупной или известной компании не является гарантией чего-либо, как и умение хорошо себя продавать.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"HTTP"},{"name":"REST API"},{"name":"Оптимизация кода"}],"accept_handicapped":true,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":true,"employer":{"id":"2416804","name":"Welltory","url":"https://api.hh.ru/employers/2416804?host=hh.ru","alternate_url":"https://hh.ru/employer/2416804","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/789298.png","240":"https://hhcdn.ru/employer-logo/3598084.png","90":"https://hhcdn.ru/employer-logo/3598083.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=2416804&host=hh.ru","trusted":true},"published_at":"2021-12-12T17:31:51+0300","created_at":"2021-12-12T17:31:51+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=50080161","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/50080161","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}